Catalogs/Автоработы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Автоработы</Name>
			<Comment>Автоработы</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Номер автоработы по каталогу</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Артикул</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АртикулДляПоиска</Name>
					<Comment>Артикул для поиска</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Артикул</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование автоработы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Базовая номенклатура автоработы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяВыполнения</Name>
					<Comment>Время выполнения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоОкраска</Name>
					<Comment>Это окраска</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Comment>Основное изображение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.АвтоработыПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИспользования</Name>
					<Comment>Определяет доступность автоработы для выбора в планировании и производстве</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИспользованияАвторабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыАвторабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДополнительноеПредложение</Name>
					<Comment>Признак того, что эта авторабота является дополнительным предложением</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеОписание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АвтоработыПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитыватьПриПоискеПовторныхРемонтов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаСтоимостиРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаСтоимостиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НормыВремени</Name>
					<Comment>Нормы времени выполнения работы</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Comment>Модель</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантКомплектации</Name>
							<Comment>Вариант комплектации автомобиля</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВыполнения</Name>
							<Comment>Время выполнения</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/СпособыРасчетаСтоимостиРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СпособыРасчетаСтоимостиРаботы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоНормеВремени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФиксированнойСуммой</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Модели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Модели</Name>
			<Comment>Модели автомобили и прочих транспортных средств</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Марки</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Код модели</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Артикул</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование модели автомобиля</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Comment>Производитель модели</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаVIN</Name>
					<Comment>Маска VIN</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>34</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автоработы</Name>
					<Comment>Группа авторабот для данной модели по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Comment>Используется для ведения дополнительного учета валютной себестоимости и цен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Покупатель/комитент, которому производится отгрузка товаров</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор по которому ведутся взаиморасчеты с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МежсервисныйИнтервалТО</Name>
					<Comment>Межсервисный интервал для тех. обслуживания</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МежсервисныйПробегТО</Name>
					<Comment>Межсервисный пробег для тех. обслуживания</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГарантии</Name>
					<Comment>Срок гарантии</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияТС</Name>
					<Comment>Категория транспортного средства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияТСКОДД</Name>
					<Comment>Категория транспортного средства согласно "Конвенции о дорожном движении"</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Comment>Основная схема транспортного средства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.МоделиПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Марка</Name>
					<Comment>Марка автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Марки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеМодели</Name>
					<Comment>Назначение модели</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.НазначениеМоделиАвтомобиля</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийДляКартинки</Name>
					<Comment>Комментарий для страницы описание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлИзображения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МоделиПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАвтомобиля</Name>
					<Comment>Тип автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыАвтомобилей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакПредметаРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакиПредметаРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Автоработы/Ext/ManagerModule.bsl
// Модуль менеджера справочника "Автоработы"
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСпособРасчетаСтоимостиРаботПоУмолчанию() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Автоработы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Автоработы КАК Автоработы
	|ГДЕ
	|	НЕ Автоработы.ЭтоГруппа
	|	И Автоработы.СпособРасчетаСтоимостиРаботы = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаСтоимостиРаботы.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Авторабота = Выборка.Ссылка.ПолучитьОбъект();
		Авторабота.СпособРасчетаСтоимостиРаботы = Перечисления.СпособыРасчетаСтоимостиРаботы.ПоНормеВремени;
		Авторабота.ОбменДанными.Загрузка = Истина;
		
		Попытка
			Авторабота.Записать();
		Исключение
			ЗаписьЖурналаРегистрации(
				СтрШаблон(
					НСтр(
						"ru = 'Ошибка обновления справочника %1'",
						ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()
					),
					"Автоработы"
				),
				УровеньЖурналаРегистрации.Предупреждение,
				, ,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
			);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

//@skip-check module-empty-method	
// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
//
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#Область Печать

// Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если СтрДлина(Параметры.СтрокаПоиска) < 3 Тогда

		СтандартнаяОбработка = Ложь;
		Возврат;

	КонецЕсли;

	СтрокаПоиска = Параметры.СтрокаПоиска;

	Если ПустаяСтрока(СтрокаПоиска) Тогда

		Возврат;

	КонецЕсли;

	Источник = ПолучитьЗначениеПараметраСтруктуры(Параметры, "Источник", "");

	Если Источник = "ИзменениеЦенАвторабот_Авторабота" Тогда

		АвтоПодборБезГрупп = "";

	Иначе

		АвтоПодборБезГрупп = " И Автоработы.ЭтоГруппа = ЛОЖЬ ";

	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	СтрокаПоискаАртикул = ОбщегоНазначенияАвтосалонКлиентСервер.ВАртикулДляПоиска(СтрокаПоиска);
	НетОтбораПоВидуИспользования = Не Параметры.Отбор.Свойство("ВидИспользования");
	ВидыИспользования = Новый Массив;

	Если Не НетОтбораПоВидуИспользования Тогда

		ВидыИспользования = Новый Массив(Параметры.Отбор.ВидИспользования);

	КонецЕсли;

	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 10
		|	Автоработы.Ссылка КАК Значение,
		|	Автоработы.Артикул КАК НайденоПо,
		|	Автоработы.Наименование КАК ДополнительноеЗначение,
		|	Автоработы.ПометкаУдаления КАК ПометкаУдаления
		|ПОМЕСТИТЬ ПодходящиеПозиции
		|ИЗ
		|	Справочник.Автоработы КАК Автоработы
		|ГДЕ
		|	Автоработы.Артикул ПОДОБНО &СтрокаПоиска СПЕЦСИМВОЛ ""~""
		|	И НЕ Автоработы.ПометкаУдаления
		|	И (&НетОтбораПоВидуИспользования
		|			ИЛИ Автоработы.ВидИспользования В (&ВидыИспользования))
		|	" + АвтоПодборБезГрупп + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 10
		|	Автоработы.Ссылка,
		|	Автоработы.Наименование,
		|	Автоработы.Артикул,
		|	Автоработы.ПометкаУдаления
		|ИЗ
		|	Справочник.Автоработы КАК Автоработы
		|ГДЕ
		|	Автоработы.Наименование ПОДОБНО &СтрокаПоиска СПЕЦСИМВОЛ ""~""
		|	И НЕ Автоработы.ПометкаУдаления
		|	И (&НетОтбораПоВидуИспользования
		|			ИЛИ Автоработы.ВидИспользования В (&ВидыИспользования))
		|	" + АвтоПодборБезГрупп + " 
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 10
		|	Автоработы.Ссылка,
		|	Автоработы.Наименование,
		|	Автоработы.Артикул,
		|	Автоработы.ПометкаУдаления
		|ИЗ
		|	Справочник.Автоработы КАК Автоработы
		|ГДЕ
		|	Автоработы.Код ПОДОБНО &СтрокаПоиска СПЕЦСИМВОЛ ""~""
		|	И НЕ Автоработы.ПометкаУдаления
		|	И (&НетОтбораПоВидуИспользования
		|			ИЛИ Автоработы.ВидИспользования В (&ВидыИспользования))
		|	" + АвтоПодборБезГрупп + "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 10
		|	Автоработы.Ссылка,
		|	Автоработы.АртикулДляПоиска,
		|	Автоработы.Наименование,
		|	Автоработы.ПометкаУдаления
		|ИЗ
		|	Справочник.Автоработы КАК Автоработы
		|ГДЕ
		|	Автоработы.АртикулДляПоиска ПОДОБНО &СтрокаПоискаАртикул СПЕЦСИМВОЛ ""~""
		|	И НЕ Автоработы.ПометкаУдаления
		|	И (&НетОтбораПоВидуИспользования
		|			ИЛИ Автоработы.ВидИспользования В (&ВидыИспользования))
		|	" + АвтоПодборБезГрупп + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 10
		|	ПодходящиеПозиции.Значение КАК Значение,
		|	ПодходящиеПозиции.ПометкаУдаления КАК ПометкаУдаления,
		|	МИНИМУМ(ПодходящиеПозиции.НайденоПо) КАК НайденоПо,
		|	МИНИМУМ(ПодходящиеПозиции.ДополнительноеЗначение) КАК ДополнительноеЗначение
		|ИЗ
		|	ПодходящиеПозиции КАК ПодходящиеПозиции
		|
		|СГРУППИРОВАТЬ ПО
		|	ПодходящиеПозиции.Значение,
		|	ПодходящиеПозиции.ПометкаУдаления"
	);
	Запрос.УстановитьПараметр("НетОтбораПоВидуИспользования", НетОтбораПоВидуИспользования);
	Запрос.УстановитьПараметр("ВидыИспользования", ВидыИспользования);
	Запрос.УстановитьПараметр("СтрокаПоиска",
		"%" + ОбщегоНазначения.СформироватьСтрокуДляПоискаВЗапросе(СтрокаПоиска) + "%"
	);
	Запрос.УстановитьПараметр("СтрокаПоискаАртикул",
		"%" + ОбщегоНазначения.СформироватьСтрокуДляПоискаВЗапросе(СтрокаПоискаАртикул) + "%"
	);
	РезультатЗапроса = Запрос.Выполнить();
	
	ДанныеВыбора = Новый СписокЗначений;

	Если РезультатЗапроса.Пустой() Тогда

		Возврат;

	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	ВыделениеСтрокиПоиска = Новый ФорматированнаяСтрока(СтрокаПоиска, Новый Шрифт(, , Истина),
		ЦветаСтиля.ЦветПоложительногоТекстаВиджета);
	ВыделениеСтрокиПоискаАртикул = Новый ФорматированнаяСтрока(СтрокаПоискаАртикул, Новый Шрифт(, , Истина),
		ЦветаСтиля.ЦветПоложительногоТекстаВиджета);
	ДлинаСтрокиПоиска = СтрДлина(СтрокаПоиска);
	ДлинаСтрокиПоискаАртикул = СтрДлина(СтрокаПоискаАртикул);

	Пока Выборка.Следующий() Цикл

		ПредставлениеСтроки = Новый Массив;
		ИндексСтрокаПоиска = СтрНайти(НРег(Выборка.НайденоПо), СтрокаПоиска);
		ИндексСтрокаПоискаАртикул = СтрНайти(НРег(Выборка.НайденоПо), СтрокаПоискаАртикул);

		Если СтрНайти(Нрег(Выборка.НайденоПо), СтрокаПоиска) > 0 Тогда

			ПредставлениеСтроки.Добавить(Лев(Выборка.НайденоПо, ИндексСтрокаПоиска - 1));
			ПредставлениеСтроки.Добавить(ВыделениеСтрокиПоиска);
			ПредставлениеСтроки.Добавить(Сред(Выборка.НайденоПо, ИндексСтрокаПоиска + ДлинаСтрокиПоиска));
			ПредставлениеСтроки.Добавить(" (");
			ПредставлениеСтроки.Добавить(Выборка.ДополнительноеЗначение);
			ПредставлениеСтроки.Добавить(")");

		ИначеЕсли СтрНайти(Нрег(Выборка.НайденоПо), СтрокаПоискаАртикул) > 0 Тогда

			ПредставлениеСтроки.Добавить(Лев(Выборка.НайденоПо, ИндексСтрокаПоискаАртикул - 1));
			ПредставлениеСтроки.Добавить(ВыделениеСтрокиПоискаАртикул);
			ПредставлениеСтроки.Добавить(Сред(Выборка.НайденоПо, ИндексСтрокаПоискаАртикул + ДлинаСтрокиПоискаАртикул));
			ПредставлениеСтроки.Добавить(" (");
			ПредставлениеСтроки.Добавить(Выборка.ДополнительноеЗначение);
			ПредставлениеСтроки.Добавить(")");

		КонецЕсли;

		ЗначениеВыбора = Новый Структура("Значение,ПометкаУдаления", Выборка.Значение, Выборка.ПометкаУдаления);
		ДанныеВыбора.Добавить(ЗначениеВыбора, Новый ФорматированнаяСтрока(ПредставлениеСтроки));

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПараметрыОбработкиРеквизитовОбъекта

Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	ОбязательныеРеквизиты = Новый Массив;
	ОбязательныеРеквизиты.Добавить("Наименование");
	
	Если Не Объект.ЭтоГруппа Тогда
		
		ОбязательныеРеквизиты.Добавить("Модель");
		ОбязательныеРеквизиты.Добавить("ВидИспользования");
		ОбязательныеРеквизиты.Добавить("Номенклатура");
		ОбязательныеРеквизиты.Добавить("НормыВремени.Модель");
		ОбязательныеРеквизиты.Добавить("НормыВремени.ВремяВыполнения");
		ОбязательныеРеквизиты.Добавить("Тип");
		ОбязательныеРеквизиты.Добавить("СпособРасчетаСтоимостиРаботы");
		
	КонецЕсли;
	
	Возврат ОбязательныеРеквизиты;
	
КонецФункции

Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт

	УникальныеРеквизиты = Новый Структура;
	УникальныеРеквизиты.Вставить("Код");

	Если Не Объект.ЭтоГруппа Тогда

		УникальныеРеквизитыНормВремени = Новый Массив;
		УникальныеРеквизитыНормВремени.Добавить("Модель");
		УникальныеРеквизитыНормВремени.Добавить("ВариантКомплектации");
		УникальныеРеквизиты.Вставить("НормыВремени", УникальныеРеквизитыНормВремени);

	КонецЕсли;

	Возврат УникальныеРеквизиты;

КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
	
// Обработчик события возникающего при изменении данных реквизита "Наименование".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура НаименованиеПриИзменении(Объект, ПараметрыДействия = Неопределено) Экспорт

	Если ПустаяСтрока(Объект.НаименованиеПолное) Тогда

		Объект.НаименованиеПолное = Объект.Наименование;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийПолейТаблицыФормыНормыВремени
	
// Обработчик события возникающего при изменении данных реквизита "Наименование".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события;
//  Строка - СтрокаТаблицыЗначений - Строка, при изменении поля которой возникло событие;
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
Процедура НормыВремениМодельПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт

	Если ЗначениеЗаполнено(Строка.ВариантКомплектации) Тогда

		Если Не Строка.ВариантКомплектации.Владелец = Строка.Модель Тогда

			Строка.ВариантКомплектации = Справочники.Модели.ПустаяСсылка();

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры
	
// Обработчик события возникающего при изменении данных реквизита "Наименование".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события;
//  Строка - СтрокаТаблицыЗначений - Строка, при изменении поля которой возникло событие;
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
Процедура НормыВремениВариантКомплектацииПриИзменении(Объект, Строка, ПараметрыДействия = Неопределено) Экспорт

	Если ЗначениеЗаполнено(Строка.ВариантКомплектации) Тогда

		НоваяМодель = Строка.ВариантКомплектации.Владелец;

		Если Не НоваяМодель = Строка.Модель Тогда

			Строка.Модель = НоваяМодель;

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ЗапретРедактированияРеквизитовОбъектов

// См. ЗапретРедактированияРеквизитовОбъектовПереопределяемый.ПриОпределенииОбъектовСЗаблокированнымиРеквизитами
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт

	Результат = Новый Массив;
	Результат.Добавить("ЦеноваяГруппа");
	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
